; ModuleID = 'main.cpp'
source_filename = "main.cpp"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx12.0.0"

%struct.__loadu_si128 = type { <2 x i64> }
%struct.__storeu_si128 = type { <2 x i64> }

@.str = private unnamed_addr constant [22 x i8] c"Naive Sum dt: %Lf ms\0A\00", align 1
@.str.1 = private unnamed_addr constant [25 x i8] c"Unrolled Sum dt: %Lf ms\0A\00", align 1
@_ZZ13sum_naive_ssePimE7ans_vec = internal global <2 x i64> zeroinitializer, align 16, !dbg !0
@_ZGVZ13sum_naive_ssePimE7ans_vec = internal global i64 0, align 8
@_ZZ13sum_naive_ssePimE1b = internal global <2 x i64> zeroinitializer, align 16, !dbg !40
@_ZGVZ13sum_naive_ssePimE1b = internal global i64 0, align 8
@.str.2 = private unnamed_addr constant [20 x i8] c"SSE Sum dt: %Lf ms\0A\00", align 1
@.str.3 = private unnamed_addr constant [29 x i8] c"Unrolled SSE Sum dt: %Lf ms\0A\00", align 1

; Function Attrs: mustprogress noinline optnone ssp uwtable
define noundef i32 @_Z9sum_naivePim(i32* noundef %0, i64 noundef %1) #0 !dbg !1305 {
  %3 = alloca i32*, align 8
  %4 = alloca i64, align 8
  %5 = alloca i64, align 8
  %6 = alloca i32, align 4
  %7 = alloca i64, align 8
  %8 = alloca i64, align 8
  store i32* %0, i32** %3, align 8
  call void @llvm.dbg.declare(metadata i32** %3, metadata !1306, metadata !DIExpression()), !dbg !1307
  store i64 %1, i64* %4, align 8

!13 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 14.0.0 (https://github.com/llvm/llvm-project.git e7298464c5d004a119583cdb8a120dc3d968508d)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !14, globals: !39, imports: !45, splitDebugInlining: false, nameTableKind: None, sysroot: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX12.1.sdk", sdk: "MacOSX12.1.sdk")
!14 = !{!15, !16, !17, !23, !29, !35}
!15 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__m128i", file: !18, line: 20, baseType: !19, align: 128)
!18 = !DIFile(filename: "/usr/local/lib/clang/14.0.0/include/emmintrin.h", directory: "")
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, flags: DIFlagVector, elements: !21)
!20 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!21 = !{!22}
!22 = !DISubrange(count: 2)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__loadu_si128", file: !18, line: 3554, size: 128, flags: DIFlagTypePassByValue, elements: !26)
!26 = !{!27}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__v", scope: !25, file: !18, line: 3555, baseType: !28, size: 128, align: 8)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__m128i_u", file: !18, line: 23, baseType: !19, align: 8)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__v4su", file: !30, line: 26, baseType: !31)
!30 = !DIFile(filename: "/usr/local/lib/clang/14.0.0/include/xmmintrin.h", directory: "")
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 128, flags: DIFlagVector, elements: !33)
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34}
!34 = !DISubrange(count: 4)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__storeu_si128", file: !18, line: 4017, size: 128, flags: DIFlagTypePassByValue, elements: !37)
!37 = !{!38}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__v", scope: !36, file: !18, line: 4018, baseType: !28, size: 128, align: 8)
!39 = !{!0, !40, !42}
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "b", scope: !2, file: !3, line: 58, type: !17, isLocal: true, isDefinition: true)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression(DW_OP_constu, 200000, DW_OP_stack_value))
!43 = distinct !DIGlobalVariable(name: "N", scope: !13, file: !3, line: 18, type: !44, isLocal: true, isDefinition: true)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!45 = !{!46, !50, !57, !64, !70, !78, !82, !86, !90, !96, !101, !105, !109, !113, !117, !122, !126, !130, !136, !140, !144, !148, !152, !157, !161, !163, !167, !169, !178, !182, !187, !191, !195, !199, !203, !205, !209, !215, !219, !223, !229, !234, !235, !239, !254, !258, !262, !267, !272, !278, !284, !288, !290, !294, !351, !352, !353, !359, !361, !365, !369, !373, !375, !379, !383, !387, !398, !400, !404, !408, !412, !414, !418, !422, !426, !428, !430, !432, !436, !440, !445, !449, !455, !459, !463, !465, !467, !469, !473, !477, !481, !483, !487, !491, !495, !497, !501, !505, !507, !511, !513, !515, !519, !520, !523, !528, !531, !534, !537, !540, !544, !547, !550, !553, !555, !557, !559, !561, !563, !565, !567, !569, !571, !573, !575, !577, !579, !581, !583, !587, !590, !593, !596, !601, !608, !610, !613, !615, !616, !620, !622, !624, !628, !630, !632, !634, !636, !638, !640, !642, !646, !650, !652, !654, !659, !664, !666, !668, !670, !672, !674, !676, !678, !680, !682, !684, !686, !688, !690, !692, !694, !696, !700, !702, !704, !706, !710, !712, !716, !718, !720, !722, !724, !728, !730, !732, !736, !738, !740, !744, !746, !750, !752, !754, !758, !760, !762, !764, !766, !768, !770, !774, !776, !778, !780, !782, !784, !786, !788, !792, !796, !798, !800, !802, !804, !806, !808, !810, !812, !814, !816, !818, !820, !822, !824, !826, !828, !830, !832, !834, !838, !840, !842, !844, !848, !850, !854, !856, !858, !860, !862, !866, !868, !872, !874, !876, !878, !880, !884, !886, !888, !892, !894, !896, !898, !902, !904, !906, !908, !910, !912, !914, !916, !918, !920, !922, !924, !926, !928, !933, !946, !948, !953, !955, !959, !963, !965, !967, !971, !973, !977, !979, !983, !988, !992, !996, !998, !1000, !1002, !1004, !1006, !1008, !1012, !1016, !1021, !1026, !1031, !1036, !1038, !1041, !1043, !1045, !1047, !1049, !1051, !1053, !1055, !1057, !1059, !1063, !1067, !1071, !1073, !1077, !1081, !1083, !1084, !1085, !1086, !1087, !1092, !1094, !1098, !1102, !1106, !1110, !1112, !1116, !1120, !1124, !1128, !1132, !1136, !1138, !1140, !1144, !1149, !1153, !1157, !1161, !1165, !1169, !1173, !1177, !1181, !1183, !1185, !1189, !1191, !1195, !1199, !1204, !1206, !1208, !1210, !1214, !1218, !1222, !1224, !1228, !1230, !1232, !1234, !1236, !1240, !1244, !1246, !1252, !1257, !1261, !1265, !1270, !1275, !1279, !1283, !1287, !1291, !1293, !1295}
!46 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !8, file: !49, line: 99)
!47 = !DINamespace(name: "__1", scope: !48, exportSymbols: true)
!48 = !DINamespace(name: "std", scope: null)
!49 = !DIFile(filename: "/usr/local/bin/../include/c++/v1/cstdlib", directory: "")
!50 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !51, file: !49, line: 100)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !52, line: 86, baseType: !53)
!52 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX12.1.sdk/usr/include/stdlib.h", directory: "")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 83, size: 64, flags: DIFlagTypePassByValue, elements: !54, identifier: "_ZTS5div_t")
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !53, file: !52, line: 84, baseType: !6, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !53, file: !52, line: 85, baseType: !6, size: 32, offset: 32)
!57 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !58, file: !49, line: 101)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !52, line: 91, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 88, size: 128, flags: DIFlagTypePassByValue, elements: !60, identifier: "_ZTS6ldiv_t")
!60 = !{!61, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !59, file: !52, line: 89, baseType: !62, size: 64)
!62 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !59, file: !52, line: 90, baseType: !62, size: 64, offset: 64)
!64 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !65, file: !49, line: 102)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !52, line: 97, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 94, size: 128, flags: DIFlagTypePassByValue, elements: !67, identifier: "_ZTS7lldiv_t")
!67 = !{!68, !69}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !66, file: !52, line: 95, baseType: !20, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !66, file: !52, line: 96, baseType: !20, size: 64, offset: 64)
!70 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !71, file: !49, line: 103)
!71 = !DISubprogram(name: "atof", scope: !52, file: !52, line: 134, type: !72, flags: DIFlagPrototyped, spFlags: 0)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !75}
!74 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!77 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!78 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !79, file: !49, line: 104)
!79 = !DISubprogram(name: "atoi", scope: !52, file: !52, line: 135, type: !80, flags: DIFlagPrototyped, spFlags: 0)
!80 = !DISubroutineType(types: !81)
!81 = !{!6, !75}
!82 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !83, file: !49, line: 105)
!83 = !DISubprogram(name: "atol", scope: !52, file: !52, line: 136, type: !84, flags: DIFlagPrototyped, spFlags: 0)
!84 = !DISubroutineType(types: !85)
!85 = !{!62, !75}
!86 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !87, file: !49, line: 106)
!87 = !DISubprogram(name: "atoll", scope: !52, file: !52, line: 139, type: !88, flags: DIFlagPrototyped, spFlags: 0)
!88 = !DISubroutineType(types: !89)
!89 = !{!20, !75}
!90 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !91, file: !49, line: 107)
!91 = !DISubprogram(name: "strtod", linkageName: "\01_strtod", scope: !52, file: !52, line: 165, type: !92, flags: DIFlagPrototyped, spFlags: 0)
!92 = !DISubroutineType(types: !93)
!93 = !{!74, !75, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!96 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !97, file: !49, line: 108)
!97 = !DISubprogram(name: "strtof", linkageName: "\01_strtof", scope: !52, file: !52, line: 166, type: !98, flags: DIFlagPrototyped, spFlags: 0)
!98 = !DISubroutineType(types: !99)
!99 = !{!100, !75, !94}
!100 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!101 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !102, file: !49, line: 109)
!102 = !DISubprogram(name: "strtold", scope: !52, file: !52, line: 169, type: !103, flags: DIFlagPrototyped, spFlags: 0)
!103 = !DISubroutineType(types: !104)
!104 = !{!15, !75, !94}
!105 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !106, file: !49, line: 110)
!106 = !DISubprogram(name: "strtol", scope: !52, file: !52, line: 167, type: !107, flags: DIFlagPrototyped, spFlags: 0)
!107 = !DISubroutineType(types: !108)
!108 = !{!62, !75, !94, !6}
!109 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !110, file: !49, line: 111)
!110 = !DISubprogram(name: "strtoll", scope: !52, file: !52, line: 172, type: !111, flags: DIFlagPrototyped, spFlags: 0)
!111 = !DISubroutineType(types: !112)
!112 = !{!20, !75, !94, !6}
!113 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !114, file: !49, line: 112)
!114 = !DISubprogram(name: "strtoul", scope: !52, file: !52, line: 175, type: !115, flags: DIFlagPrototyped, spFlags: 0)
!115 = !DISubroutineType(types: !116)
!116 = !{!12, !75, !94, !6}
!117 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !118, file: !49, line: 113)
!118 = !DISubprogram(name: "strtoull", scope: !52, file: !52, line: 178, type: !119, flags: DIFlagPrototyped, spFlags: 0)
!119 = !DISubroutineType(types: !120)
!120 = !{!121, !75, !94, !6}
!121 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!122 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !123, file: !49, line: 114)
!123 = !DISubprogram(name: "rand", scope: !52, file: !52, line: 162, type: !124, flags: DIFlagPrototyped, spFlags: 0)
!124 = !DISubroutineType(types: !125)
!125 = !{!6}
!126 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !127, file: !49, line: 115)
!127 = !DISubprogram(name: "srand", scope: !52, file: !52, line: 164, type: !128, flags: DIFlagPrototyped, spFlags: 0)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !32}
!130 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !131, file: !49, line: 116)
!131 = !DISubprogram(name: "calloc", scope: !132, file: !132, line: 41, type: !133, flags: DIFlagPrototyped, spFlags: 0)
!132 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX12.1.sdk/usr/include/malloc/_malloc.h", directory: "")
!133 = !DISubroutineType(types: !134)
!134 = !{!135, !8, !8}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!136 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !137, file: !49, line: 117)
!137 = !DISubprogram(name: "free", scope: !132, file: !132, line: 42, type: !138, flags: DIFlagPrototyped, spFlags: 0)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !135}
!140 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !141, file: !49, line: 118)
!141 = !DISubprogram(name: "malloc", scope: !132, file: !132, line: 40, type: !142, flags: DIFlagPrototyped, spFlags: 0)
!142 = !DISubroutineType(types: !143)
!143 = !{!135, !8}
!144 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !145, file: !49, line: 119)
!145 = !DISubprogram(name: "realloc", scope: !132, file: !132, line: 43, type: !146, flags: DIFlagPrototyped, spFlags: 0)
!146 = !DISubroutineType(types: !147)
!147 = !{!135, !135, !8}
!148 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !149, file: !49, line: 120)
!149 = !DISubprogram(name: "abort", scope: !52, file: !52, line: 131, type: !150, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!150 = !DISubroutineType(types: !151)
!151 = !{null}
!152 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !153, file: !49, line: 121)
!153 = !DISubprogram(name: "atexit", scope: !52, file: !52, line: 133, type: !154, flags: DIFlagPrototyped, spFlags: 0)
!154 = !DISubroutineType(types: !155)
!155 = !{!6, !156}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!157 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !158, file: !49, line: 122)
!158 = !DISubprogram(name: "exit", scope: !52, file: !52, line: 145, type: !159, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !6}
!161 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !162, file: !49, line: 123)
!162 = !DISubprogram(name: "_Exit", scope: !52, file: !52, line: 191, type: !159, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!163 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !164, file: !49, line: 125)
!164 = !DISubprogram(name: "getenv", scope: !52, file: !52, line: 147, type: !165, flags: DIFlagPrototyped, spFlags: 0)
!165 = !DISubroutineType(types: !166)
!166 = !{!95, !75}
!167 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !168, file: !49, line: 126)
!168 = !DISubprogram(name: "system", linkageName: "\01_system", scope: !52, file: !52, line: 184, type: !80, flags: DIFlagPrototyped, spFlags: 0)
!169 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !170, file: !49, line: 128)
!170 = !DISubprogram(name: "bsearch", scope: !52, file: !52, line: 141, type: !171, flags: DIFlagPrototyped, spFlags: 0)
!171 = !DISubroutineType(types: !172)
!172 = !{!135, !173, !173, !8, !8, !175}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!6, !173, !173}
!178 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !179, file: !49, line: 129)
!179 = !DISubprogram(name: "qsort", scope: !52, file: !52, line: 160, type: !180, flags: DIFlagPrototyped, spFlags: 0)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !135, !8, !8, !175}
!182 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !183, file: !49, line: 130)
!183 = !DISubprogram(name: "abs", linkageName: "_Z3abse", scope: !184, file: !184, line: 129, type: !185, flags: DIFlagPrototyped, spFlags: 0)
!184 = !DIFile(filename: "/usr/local/bin/../include/c++/v1/stdlib.h", directory: "")
!185 = !DISubroutineType(types: !186)
!186 = !{!15, !15}
!187 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !188, file: !49, line: 131)
!188 = !DISubprogram(name: "labs", scope: !52, file: !52, line: 148, type: !189, flags: DIFlagPrototyped, spFlags: 0)
!189 = !DISubroutineType(types: !190)
!190 = !{!62, !62}
!191 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !192, file: !49, line: 132)
!192 = !DISubprogram(name: "llabs", scope: !52, file: !52, line: 152, type: !193, flags: DIFlagPrototyped, spFlags: 0)
!193 = !DISubroutineType(types: !194)
!194 = !{!20, !20}
!195 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !196, file: !49, line: 133)
!196 = !DISubprogram(name: "div", linkageName: "_Z3divxx", scope: !184, file: !184, line: 152, type: !197, flags: DIFlagPrototyped, spFlags: 0)
!197 = !DISubroutineType(types: !198)
!198 = !{!65, !20, !20}
!199 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !200, file: !49, line: 134)
!200 = !DISubprogram(name: "ldiv", scope: !52, file: !52, line: 149, type: !201, flags: DIFlagPrototyped, spFlags: 0)
!201 = !DISubroutineType(types: !202)
!202 = !{!58, !62, !62}
!203 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !204, file: !49, line: 135)
!204 = !DISubprogram(name: "lldiv", scope: !52, file: !52, line: 153, type: !197, flags: DIFlagPrototyped, spFlags: 0)
!205 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !206, file: !49, line: 136)
!206 = !DISubprogram(name: "mblen", scope: !52, file: !52, line: 156, type: !207, flags: DIFlagPrototyped, spFlags: 0)
!207 = !DISubroutineType(types: !208)
!208 = !{!6, !75, !8}
!209 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !210, file: !49, line: 137)
!210 = !DISubprogram(name: "mbtowc", scope: !52, file: !52, line: 158, type: !211, flags: DIFlagPrototyped, spFlags: 0)
!211 = !DISubroutineType(types: !212)
!212 = !{!6, !213, !75, !8}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!215 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !216, file: !49, line: 138)
!216 = !DISubprogram(name: "wctomb", scope: !52, file: !52, line: 188, type: !217, flags: DIFlagPrototyped, spFlags: 0)
!217 = !DISubroutineType(types: !218)
!218 = !{!6, !95, !214}
!219 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !220, file: !49, line: 139)
!220 = !DISubprogram(name: "mbstowcs", scope: !52, file: !52, line: 157, type: !221, flags: DIFlagPrototyped, spFlags: 0)
!221 = !DISubroutineType(types: !222)
!222 = !{!8, !213, !75, !8}
!223 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !224, file: !49, line: 140)
!224 = !DISubprogram(name: "wcstombs", scope: !52, file: !52, line: 187, type: !225, flags: DIFlagPrototyped, spFlags: 0)
!225 = !DISubroutineType(types: !226)
!226 = !{!8, !95, !227, !8}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!229 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !230, file: !233, line: 71)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_t", file: !231, line: 31, baseType: !232)
!231 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX12.1.sdk/usr/include/sys/_types/_clock_t.h", directory: "")
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_clock_t", file: !11, line: 119, baseType: !12)
!233 = !DIFile(filename: "/usr/local/bin/../include/c++/v1/ctime", directory: "")
!234 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !8, file: !233, line: 72)
!235 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !236, file: !233, line: 73)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !237, line: 31, baseType: !238)
!237 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX12.1.sdk/usr/include/sys/_types/_time_t.h", directory: "")
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !11, line: 122, baseType: !62)
!239 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !240, file: !233, line: 74)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !241, line: 75, size: 448, flags: DIFlagTypePassByValue, elements: !242, identifier: "_ZTS2tm")
!241 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX12.1.sdk/usr/include/time.h", directory: "")
!242 = !{!243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !240, file: !241, line: 76, baseType: !6, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !240, file: !241, line: 77, baseType: !6, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !240, file: !241, line: 78, baseType: !6, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !240, file: !241, line: 79, baseType: !6, size: 32, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !240, file: !241, line: 80, baseType: !6, size: 32, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !240, file: !241, line: 81, baseType: !6, size: 32, offset: 160)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !240, file: !241, line: 82, baseType: !6, size: 32, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !240, file: !241, line: 83, baseType: !6, size: 32, offset: 224)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !240, file: !241, line: 84, baseType: !6, size: 32, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !240, file: !241, line: 85, baseType: !62, size: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !240, file: !241, line: 86, baseType: !95, size: 64, offset: 384)
!254 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !255, file: !233, line: 78)
!255 = !DISubprogram(name: "clock", linkageName: "\01_clock", scope: !241, file: !241, line: 109, type: !256, flags: DIFlagPrototyped, spFlags: 0)
!256 = !DISubroutineType(types: !257)
!257 = !{!230}
!258 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !259, file: !233, line: 79)
!259 = !DISubprogram(name: "difftime", scope: !241, file: !241, line: 111, type: !260, flags: DIFlagPrototyped, spFlags: 0)
!260 = !DISubroutineType(types: !261)
!261 = !{!74, !236, !236}
!262 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !263, file: !233, line: 80)
!263 = !DISubprogram(name: "mktime", linkageName: "\01_mktime", scope: !241, file: !241, line: 115, type: !264, flags: DIFlagPrototyped, spFlags: 0)
!264 = !DISubroutineType(types: !265)
!265 = !{!236, !266}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!267 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !268, file: !233, line: 81)
!268 = !DISubprogram(name: "time", scope: !241, file: !241, line: 118, type: !269, flags: DIFlagPrototyped, spFlags: 0)
!269 = !DISubroutineType(types: !270)
!270 = !{!236, !271}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!272 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !273, file: !233, line: 82)
!273 = !DISubprogram(name: "asctime", scope: !241, file: !241, line: 108, type: !274, flags: DIFlagPrototyped, spFlags: 0)
!274 = !DISubroutineType(types: !275)
!275 = !{!95, !276}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!278 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !279, file: !233, line: 83)
!279 = !DISubprogram(name: "ctime", scope: !241, file: !241, line: 110, type: !280, flags: DIFlagPrototyped, spFlags: 0)
!280 = !DISubroutineType(types: !281)
!281 = !{!95, !282}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!284 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !285, file: !233, line: 84)
!285 = !DISubprogram(name: "gmtime", scope: !241, file: !241, line: 113, type: !286, flags: DIFlagPrototyped, spFlags: 0)
!286 = !DISubroutineType(types: !287)
!287 = !{!266, !282}
!288 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !289, file: !233, line: 85)
!289 = !DISubprogram(name: "localtime", scope: !241, file: !241, line: 114, type: !286, flags: DIFlagPrototyped, spFlags: 0)
!290 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !291, file: !233, line: 86)
!291 = !DISubprogram(name: "strftime", linkageName: "\01_strftime", scope: !241, file: !241, line: 116, type: !292, flags: DIFlagPrototyped, spFlags: 0)
!292 = !DISubroutineType(types: !293)
!293 = !{!8, !95, !8, !75, !276}
!294 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !295, file: !350, line: 107)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !296, line: 157, baseType: !297)
!296 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX12.1.sdk/usr/include/_stdio.h", directory: "")
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !296, line: 126, size: 1216, flags: DIFlagTypePassByValue, elements: !298, identifier: "_ZTS7__sFILE")
!298 = !{!299, !302, !303, !304, !306, !307, !312, !313, !314, !318, !322, !330, !334, !335, !338, !339, !343, !347, !348, !349}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !297, file: !296, line: 127, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !297, file: !296, line: 128, baseType: !6, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !297, file: !296, line: 129, baseType: !6, size: 32, offset: 96)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !297, file: !296, line: 130, baseType: !305, size: 16, offset: 128)
!305 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !297, file: !296, line: 131, baseType: !305, size: 16, offset: 144)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !297, file: !296, line: 132, baseType: !308, size: 128, offset: 192)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !296, line: 92, size: 128, flags: DIFlagTypePassByValue, elements: !309, identifier: "_ZTS6__sbuf")
!309 = !{!310, !311}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !308, file: !296, line: 93, baseType: !300, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !308, file: !296, line: 94, baseType: !6, size: 32, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !297, file: !296, line: 133, baseType: !6, size: 32, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !297, file: !296, line: 136, baseType: !135, size: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !297, file: !296, line: 137, baseType: !315, size: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!6, !135}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !297, file: !296, line: 138, baseType: !319, size: 64, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!6, !135, !95, !6}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !297, file: !296, line: 139, baseType: !323, size: 64, offset: 576)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!326, !135, !326, !6}
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !296, line: 81, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !328, line: 71, baseType: !329)
!328 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX12.1.sdk/usr/include/sys/_types.h", directory: "")
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !11, line: 48, baseType: !20)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !297, file: !296, line: 140, baseType: !331, size: 64, offset: 640)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!6, !135, !75, !6}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !297, file: !296, line: 143, baseType: !308, size: 128, offset: 704)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !297, file: !296, line: 144, baseType: !336, size: 64, offset: 832)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !296, line: 98, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS8__sFILEX")
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !297, file: !296, line: 145, baseType: !6, size: 32, offset: 896)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !297, file: !296, line: 148, baseType: !340, size: 24, offset: 928)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 24, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 3)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !297, file: !296, line: 149, baseType: !344, size: 8, offset: 952)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 8, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 1)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !297, file: !296, line: 152, baseType: !308, size: 128, offset: 960)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !297, file: !296, line: 155, baseType: !6, size: 32, offset: 1088)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !297, file: !296, line: 156, baseType: !326, size: 64, offset: 1152)
!350 = !DIFile(filename: "/usr/local/bin/../include/c++/v1/cstdio", directory: "")
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !326, file: !350, line: 108)
!352 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !8, file: !350, line: 109)
!353 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !354, file: !350, line: 111)
!354 = !DISubprogram(name: "fclose", scope: !355, file: !355, line: 143, type: !356, flags: DIFlagPrototyped, spFlags: 0)
!355 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX12.1.sdk/usr/include/stdio.h", directory: "")
!356 = !DISubroutineType(types: !357)
!357 = !{!6, !358}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!359 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !360, file: !350, line: 112)
!360 = !DISubprogram(name: "fflush", scope: !355, file: !355, line: 146, type: !356, flags: DIFlagPrototyped, spFlags: 0)
!361 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !362, file: !350, line: 113)
!362 = !DISubprogram(name: "setbuf", scope: !355, file: !355, line: 178, type: !363, flags: DIFlagPrototyped, spFlags: 0)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !358, !95}
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !366, file: !350, line: 114)
!366 = !DISubprogram(name: "setvbuf", scope: !355, file: !355, line: 179, type: !367, flags: DIFlagPrototyped, spFlags: 0)
!367 = !DISubroutineType(types: !368)
!368 = !{!6, !358, !95, !6, !8}
!369 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !370, file: !350, line: 115)
!370 = !DISubprogram(name: "fprintf", scope: !355, file: !355, line: 155, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!371 = !DISubroutineType(types: !372)
!372 = !{!6, !358, !75, null}
!373 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !374, file: !350, line: 116)
!374 = !DISubprogram(name: "fscanf", scope: !355, file: !355, line: 161, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !376, file: !350, line: 117)
!376 = !DISubprogram(name: "snprintf", scope: !355, file: !355, line: 327, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!377 = !DISubroutineType(types: !378)
!378 = !{!6, !95, !8, !75, null}
!379 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !380, file: !350, line: 118)
!380 = !DISubprogram(name: "sprintf", scope: !355, file: !355, line: 180, type: !381, flags: DIFlagPrototyped, spFlags: 0)
!381 = !DISubroutineType(types: !382)
!382 = !{!6, !95, !75, null}
!383 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !384, file: !350, line: 119)
!384 = !DISubprogram(name: "sscanf", scope: !355, file: !355, line: 181, type: !385, flags: DIFlagPrototyped, spFlags: 0)
!385 = !DISubroutineType(types: !386)
!386 = !{!6, !75, !75, null}
!387 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !388, file: !350, line: 120)
!388 = !DISubprogram(name: "vfprintf", scope: !355, file: !355, line: 190, type: !389, flags: DIFlagPrototyped, spFlags: 0)
!389 = !DISubroutineType(types: !390)
!390 = !{!6, !358, !75, !391}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, flags: DIFlagTypePassByValue, elements: !393, identifier: "_ZTS13__va_list_tag")
!393 = !{!394, !395, !396, !397}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !392, file: !3, baseType: !32, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !392, file: !3, baseType: !32, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !392, file: !3, baseType: !135, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !392, file: !3, baseType: !135, size: 64, offset: 128)
!398 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !399, file: !350, line: 121)
!399 = !DISubprogram(name: "vfscanf", scope: !355, file: !355, line: 328, type: !389, flags: DIFlagPrototyped, spFlags: 0)
!400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !401, file: !350, line: 122)
!401 = !DISubprogram(name: "vsscanf", scope: !355, file: !355, line: 331, type: !402, flags: DIFlagPrototyped, spFlags: 0)
!402 = !DISubroutineType(types: !403)
!403 = !{!6, !75, !75, !391}
!404 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !405, file: !350, line: 123)
!405 = !DISubprogram(name: "vsnprintf", scope: !355, file: !355, line: 330, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!406 = !DISubroutineType(types: !407)
!407 = !{!6, !95, !8, !75, !391}
!408 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !409, file: !350, line: 124)
!409 = !DISubprogram(name: "vsprintf", scope: !355, file: !355, line: 192, type: !410, flags: DIFlagPrototyped, spFlags: 0)
!410 = !DISubroutineType(types: !411)
!411 = !{!6, !95, !75, !391}
!412 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !413, file: !350, line: 125)
!413 = !DISubprogram(name: "fgetc", scope: !355, file: !355, line: 147, type: !356, flags: DIFlagPrototyped, spFlags: 0)
!414 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !415, file: !350, line: 126)
!415 = !DISubprogram(name: "fgets", scope: !355, file: !355, line: 149, type: !416, flags: DIFlagPrototyped, spFlags: 0)
!416 = !DISubroutineType(types: !417)
!417 = !{!95, !95, !6, !358}
!418 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !419, file: !350, line: 127)
!419 = !DISubprogram(name: "fputc", scope: !355, file: !355, line: 156, type: !420, flags: DIFlagPrototyped, spFlags: 0)
!420 = !DISubroutineType(types: !421)
!421 = !{!6, !6, !358}
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !423, file: !350, line: 128)
!423 = !DISubprogram(name: "fputs", linkageName: "\01_fputs", scope: !355, file: !355, line: 157, type: !424, flags: DIFlagPrototyped, spFlags: 0)
!424 = !DISubroutineType(types: !425)
!425 = !{!6, !75, !358}
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !427, file: !350, line: 129)
!427 = !DISubprogram(name: "getc", scope: !355, file: !355, line: 166, type: !356, flags: DIFlagPrototyped, spFlags: 0)
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !429, file: !350, line: 130)
!429 = !DISubprogram(name: "putc", scope: !355, file: !355, line: 171, type: !420, flags: DIFlagPrototyped, spFlags: 0)
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !431, file: !350, line: 131)
!431 = !DISubprogram(name: "ungetc", scope: !355, file: !355, line: 189, type: !420, flags: DIFlagPrototyped, spFlags: 0)
!432 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !433, file: !350, line: 132)
!433 = !DISubprogram(name: "fread", scope: !355, file: !355, line: 158, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!434 = !DISubroutineType(types: !435)
!435 = !{!8, !135, !8, !8, !358}
!436 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !437, file: !350, line: 133)
!437 = !DISubprogram(name: "fwrite", linkageName: "\01_fwrite", scope: !355, file: !355, line: 165, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!438 = !DISubroutineType(types: !439)
!439 = !{!8, !173, !8, !8, !358}
!440 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !47, entity: !441, file: !350, line: 135)
!441 = !DISubprogram(name: "fgetpos", scope: !355, file: !355, line: 148, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!442 = !DISubroutineType(types: !443)
!443 = !{!6, !358, !444}
